; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_10)

(:domain logistics)

(:objects
	obj0 obj2 - airport
	obj1 obj3 - city
	obj4 obj5 - truck
	obj6 obj8 obj10 obj12 obj15 obj16 - package
	obj7 obj9 obj11 obj14 - location
	obj13 - airplane
)

(:init
	(at obj4 obj2)
	(at obj5 obj0)
	(at obj6 obj2)
	(at obj8 obj2)
	(at obj10 obj9)
	(at obj12 obj0)
	(at obj13 obj2)
	(at obj15 obj2)
	(at obj16 obj2)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj7 obj1)
	(in-city obj9 obj3)
	(in-city obj11 obj1)
	(in-city obj14 obj1)
)

(:goal (and
	(at obj6 obj11)
	(at obj8 obj11)
	(at obj10 obj9)
	(at obj12 obj9)
	(at obj15 obj7)
	(at obj16 obj14)
))
)

; plan
1. (drive obj4 obj2 obj9)
   deleted: (at obj4 obj2)
   added: (at obj4 obj9)
   goals met: 1 of 6
2. (drive obj5 obj0 obj14)
   deleted: (at obj5 obj0)
   added: (at obj5 obj14)
   goals met: 1 of 6
3. (load obj13 obj15 obj2)
   deleted: (at obj15 obj2)
   added: (in obj15 obj13)
   goals met: 1 of 6
4. (load obj13 obj16 obj2)
   deleted: (at obj16 obj2)
   added: (in obj16 obj13)
   goals met: 1 of 6
5. (load obj13 obj6 obj2)
   deleted: (at obj6 obj2)
   added: (in obj6 obj13)
   goals met: 1 of 6
6. (load obj13 obj8 obj2)
   deleted: (at obj8 obj2)
   added: (in obj8 obj13)
   goals met: 1 of 6
7. (fly obj13 obj2 obj0)
   deleted: (at obj13 obj2)
   added: (at obj13 obj0)
   goals met: 1 of 6
8. (drive obj4 obj9 obj2)
   deleted: (at obj4 obj9)
   added: (at obj4 obj2)
   goals met: 1 of 6
9. (drive obj5 obj14 obj0)
   deleted: (at obj5 obj14)
   added: (at obj5 obj0)
   goals met: 1 of 6
10. (unload obj13 obj15 obj0)
   deleted: (in obj15 obj13)
   added: (at obj15 obj0)
   goals met: 1 of 6
11. (unload obj13 obj16 obj0)
   deleted: (in obj16 obj13)
   added: (at obj16 obj0)
   goals met: 1 of 6
12. (unload obj13 obj6 obj0)
   deleted: (in obj6 obj13)
   added: (at obj6 obj0)
   goals met: 1 of 6
13. (unload obj13 obj8 obj0)
   deleted: (in obj8 obj13)
   added: (at obj8 obj0)
   goals met: 1 of 6
14. (drive obj4 obj2 obj9)
   deleted: (at obj4 obj2)
   added: (at obj4 obj9)
   goals met: 1 of 6
15. (load obj13 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj13)
   goals met: 1 of 6
16. (load obj13 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj13)
   goals met: 1 of 6
17. (load obj5 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj5)
   goals met: 1 of 6
18. (drive obj5 obj0 obj7)
   deleted: (at obj5 obj0)
   added: (at obj5 obj7)
   goals met: 1 of 6
19. (drive obj4 obj9 obj2)
   deleted: (at obj4 obj9)
   added: (at obj4 obj2)
   goals met: 1 of 6
20. (load obj13 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj13)
   goals met: 1 of 6
21. (load obj13 obj6 obj0)
   deleted: (at obj6 obj0)
   added: (in obj6 obj13)
   goals met: 1 of 6
22. (unload obj13 obj12 obj0)
   deleted: (in obj12 obj13)
   added: (at obj12 obj0)
   goals met: 1 of 6
23. (unload obj5 obj15 obj7)
   deleted: (in obj15 obj5)
   added: (at obj15 obj7)
   goals met: 2 of 6
24. (drive obj5 obj7 obj14)
   deleted: (at obj5 obj7)
   added: (at obj5 obj14)
   goals met: 2 of 6
25. (load obj13 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj13)
   goals met: 2 of 6
26. (unload obj13 obj8 obj0)
   deleted: (in obj8 obj13)
   added: (at obj8 obj0)
   goals met: 2 of 6
27. (fly obj13 obj0 obj2)
   deleted: (at obj13 obj0)
   added: (at obj13 obj2)
   goals met: 2 of 6
28. (drive obj5 obj14 obj7)
   deleted: (at obj5 obj14)
   added: (at obj5 obj7)
   goals met: 2 of 6
29. (fly obj13 obj2 obj0)
   deleted: (at obj13 obj2)
   added: (at obj13 obj0)
   goals met: 2 of 6
30. (drive obj5 obj7 obj0)
   deleted: (at obj5 obj7)
   added: (at obj5 obj0)
   goals met: 2 of 6
31. (unload obj13 obj16 obj0)
   deleted: (in obj16 obj13)
   added: (at obj16 obj0)
   goals met: 2 of 6
32. (unload obj13 obj6 obj0)
   deleted: (in obj6 obj13)
   added: (at obj6 obj0)
   goals met: 2 of 6
33. (fly obj13 obj0 obj2)
   deleted: (at obj13 obj0)
   added: (at obj13 obj2)
   goals met: 2 of 6
34. (load obj5 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj5)
   goals met: 2 of 6
35. (load obj5 obj6 obj0)
   deleted: (at obj6 obj0)
   added: (in obj6 obj5)
   goals met: 2 of 6
36. (load obj5 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj5)
   goals met: 2 of 6
37. (unload obj13 obj12 obj2)
   deleted: (in obj12 obj13)
   added: (at obj12 obj2)
   goals met: 2 of 6
38. (drive obj5 obj0 obj14)
   deleted: (at obj5 obj0)
   added: (at obj5 obj14)
   goals met: 2 of 6
39. (load obj4 obj12 obj2)
   deleted: (at obj12 obj2)
   added: (in obj12 obj4)
   goals met: 2 of 6
40. (unload obj5 obj16 obj14)
   deleted: (in obj16 obj5)
   added: (at obj16 obj14)
   goals met: 3 of 6
41. (drive obj4 obj2 obj9)
   deleted: (at obj4 obj2)
   added: (at obj4 obj9)
   goals met: 3 of 6
42. (drive obj5 obj14 obj11)
   deleted: (at obj5 obj14)
   added: (at obj5 obj11)
   goals met: 3 of 6
43. (unload obj4 obj12 obj9)
   deleted: (in obj12 obj4)
   added: (at obj12 obj9)
   goals met: 4 of 6
44. (unload obj5 obj6 obj11)
   deleted: (in obj6 obj5)
   added: (at obj6 obj11)
   goals met: 5 of 6
45. (unload obj5 obj8 obj11)
   deleted: (in obj8 obj5)
   added: (at obj8 obj11)
   goals met: 6 of 6
